/*************************************************************************
 * Copyright (C) 2023 Xmsilicon Tech. Co., Ltd.
 * @File Name: cr_lcd.h
 * @Description: 
 * @Author: songliuyang
 * @Created Time: 2023.01.28
 * @Modification: 
 ************************************************************************/

#ifndef __CR_SDIO_H__
#define __CR_SDIO_H__

#ifdef __cplusplus
extern "C"
{
#endif /* __cplusplus */


/******************************************************************************
 *	函数: LIBCR_SDIO0_Status
 *	描述: 查看sdio0是否存在sd卡
 *	参数: 无
 *	返回值:失败返回-1，存在返回1，不存在返回0
 *****************************************************************************/
int LIBCR_SDIO0_Status();


/******************************************************************************
 *	函数: LIBCR_SDIO1_Status
 *	描述: 查看sdio1是否存在sd卡
 *	参数: 无
 *	返回值:失败返回-1，存在返回1，不存在返回0
 *****************************************************************************/
int LIBCR_SDIO1_Status();

/******************************************************************************
 *	函数: LIBCR_SDIO_Ssr
 *	描述: 读取sdio的ssr信息返回
 *	参数: buff, 空间不小于128个字节
 *	返回值:失败返回-1，成功返回0
 *****************************************************************************/
int LIBCR_SDIO_Ssr(char* buff);

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* __CR_SDIO_H__ */
